[
  {
    "id": 1,
    "name": "Paige Williams",
    "title": "Financial Coach",
    "bookingurl": "https://calendly.com/paigevic98/strategy-session-paige",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Debt Management, Saving, Investing",
    "certifications": "Bachelor's Degree in Biopsychology, Master's Degree in Medical Sciences – Liberty University (2022), Founder of the Millennium Money Master Program, Helped over 100 clients",
    "song": "\"Upgrade U\" by Beyonce",
    "yoe": 8,
    "clientele": "Early to mid-career professional women in their mid-20s and 30s who are looking to build long-term wealth. Income Level: Annual incomes ranging from $40,000 to $100,000. Occupation: A mix of salaried professionals, entrepreneurs, and freelancers. Challenges: Struggle with balancing short-term wants and long-term goals, navigating credit, and establishing clear financial systems.",
    "longbio": "I'm a passionate Money Coach and Online Content Creator dedicated to empowering women to take full control of their finances and build long-term wealth. In just 5 months, I paid off $3,000 in credit card debt, saved $5,000 in an emergency fund, and invested $10,000—all while juggling grad school and part-time jobs. This transformation inspired me to create the Millennium Money Master Program, a high-impact coaching program that has helped over 100 clients achieve financial confidence through crushing debt, investing, and strategic money management. My mission is to make personal finance fun, attainable, and attractive while inspiring others to take action, no matter where they're starting",
    "previewblurb": "Empowering women to crush debt, invest smartly, and build lasting financial confidence!",
    "profileurl": "/experts/PaigeW.jpg"
  },
  {
    "id": 2,
    "name": "Constance McConnell",
    "title": "Financial Therapist",
    "bookingurl": "https://tidycal.com/constance/15-minute-meeting",
    "demourl": "",
    "therapist_email": "",
    "expertise": "trauma informed financial therapy, coaching, scarcity mindset, overspending, first generation of wealth building, imposter syndrome, money avoidance, financial anxiety, immigration court, inheritance, financial trauma, corporate wellness, legal settlement caused by trauma, job promotion, relocation, multigenerational wealth, group financial wellness coaching",
    "certifications": "Licensed Clinical Social Worker, Certified Financial Social Worker, Therapist",
    "song": "\"Golden\" by Jill Scott",
    "yoe": 13,
    "clientele": "Historically marginalized professionals (Black, Brown, Women, Neurodiverse, LGBTQ+ communities)  who don't mind telling their money story via mindful journaling.",
    "longbio": "A core part of my approach is helping clients understand the historical and systemic roots of their financial challenges. By educating them on the broader economic forces that impact wealth-building—alongside personal finance habits—they gain insight, reduce shame, and build the confidence to take control of their money narrative. This is especially powerful for those who’ve internalized blame for barriers that were never theirs to carry. I provide therapy, coaching and educational webinars to the community on my specialty. I love empowering individuals and the community to not just manage their money—but to heal their relationship with it.",
    "previewblurb": "A financial therapist and author, enhancing relationships with money through empowerment!",
    "profileurl": "/experts/Constance.jpg"
  },
  {
    "id": 3,
    "name": "Michele Paiva",
    "title": "Financial Therapist",
    "bookingurl": "https://calendar.google.com/calendar/u/0/appointments/schedules/AcZssZ0UFT_d-qD0-vrKP3zy6VUZvFptyZgGjKVAzCqySKNKqezQ0kVMB4PualxwcyGkK1jXnbzYRB9K",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Business Management, Family Planning, Couples, Clinical Autism Specialist",
    "certifications": "Licensed Psychotherapist specializing in Trauma and Financial Therapy, Certified Clinical Autism Specialist, Certified Financial Educator, Certified Financial Social Worker, Lifestyle Science Certified, Certified Clinical Meditation (Through University of Mass)",
    "song": "Ain't Misbehavin\" by Fats Waller",
    "yoe": 10,
    "clientele": "21 - 55. Mid Income. Millennials enjoy that I've been there, done that, and lived to tell; older clients appreciate that I've already put children through college, invested in property, etc., beyond \"just getting out of debt\" etc.",
    "longbio": "Michele Paiva is a financial therapist, trauma therapist, fractional CMO, and publicist with over 30 years of experience helping individuals and businesses thrive. Millennials value her relatable, \"I’ve been there\" approach, while Boomers appreciate her wisdom from successfully living through life’s financial challenges. Michele’s work focuses on uncovering the emotions beneath financial struggles, resolving couples' money conflicts, and empowering clients to showcase their value, build abundance, and create lasting change. Michele has autism and is also a certified clinical autism specialist who enjoys helping neurodivergent employees regain their feelings and finances. In 2023, she was voted top 100 publicists out of 14,000. She likes Tofu.",
    "previewblurb": "A casual approach to emotional depth and elegant living!",
    "profileurl": "/experts/Michele.jpeg"
  },
  {
    "id": 5,
    "name": "Aitzarelys Negrón",
    "title": "Financial Coach",
    "bookingurl": "https://StrategiesandTEA.as.me/?appointmentType=72189521",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Entrepreneurship, Paycheck to purpose, Mindset shifts, Money audits, Bugeting, Business Bookkeeping, Business essentials, Profit Management, Debt Management, Burnout, Cash Flow",
    "certifications": "Certified Public Accountant (CPA), QuickBooks Online Certified, ProAdvisor, Accredited Financial Counselor (Studying/In Process)",
    "song": "\"Level Up\" by Ciara",
    "yoe": 10,
    "clientele": "25–45 years old. Professionals, Aspiring entrepreneurs. Income: $70,000–$150,000+.",
    "longbio": "Aitza is a passionate financial coach, accountant, and entrepreneur dedicated to helping professionals and aspiring business owners achieve financial clarity and time freedom. With a background as a CPA and years of experience in personal finance and business management, she empowers her clients to bridge the gap between their current reality and their ideal lifestyle. Aitza's journey into financial coaching was inspired by her own transformational story—turning her life around in high school with the support of a mentor, she now dedicates her career to helping others see possibilities and take control of their futures. Her coaching program, moneyFLOW$™ Academy, guides high-earning professionals through mastering personal finances, reducing debt, and building sustainable businesses. In addition to coaching, Aitza specializes in bookkeeping, bookkeeping diagnostics, Profit First implementation, and financial clean-ups, ensuring business owners have the tools they need for long-term profitability. Her clients have achieved remarkable results, from saving thousands of dollars to confidently launching businesses that align with their goals and values. Aitza's mission is to create financial confidence and economic resilience for her clients, equipping them to build wealth and lead change for themselves, their families, and their communities.",
    "previewblurb": "Transforming finances, empowering dreams, and creating lasting wealth!",
    "profileurl": "/experts/Aitzarelys.jpeg"
  },
  {
    "id": 6,
    "name": "Maureen Kelley",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/mk-maureenkelley",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Family, Wealth Management, Positive Psychology",
    "certifications": "BS, University of Rhode Island Graduate Cert Financial Therapy, Kansas State Univ Executive Women's Leadership, The Wharton School - Certification Applied Positive Psychology, Univ of Penn Certified Financial Therapist (CFT), Certified Financial Behavior Specialist (FBS), Accredited Wealth Management Advisor (AWMA), Certified Family Wealth Advisor (CFWA), Certified Family Coach(CFC), Certified Co-Parenting Specialist",
    "song": "\"You've Got a Friend\" by James Taylor",
    "yoe": 30,
    "clientele": "People from all walks of life. Young adults, individuals, co-parents, couples and families. She has helped those who struggle with making ends meet, people navigating divorce issues, to multi-generational complex families of wealth.",
    "longbio": "Maureen Kelley has more than 30 years' experience helping families navigate the complex intersection of economics and emotions. As a seasoned family dynamics coach and family wealth consultant, she's dedicated to creating a safe space for you to share the ups and downs of your financial journey. Maureen works to dismantle the stigma surrounding these conversations, making hard-to-talk-about topics a lot easier. Having held senior positions at financial institutions like BOK Financial Private Wealth and Wells Fargo Private Bank, Maureen offers years of expertise in wealth management and positive psychology, helping you improve your financial life by improving your relationship with yourself and your loved ones. Working with Maureen, you'll rewrite your 'money scripts'—the narratives we develop around wealth in childhood—and better understand how your past shapes your present views on money. As the founder of a family dynamics and financial coaching practice, Maureen's dedication to family is evident. Her services have been utilized by people of all walks of life, including young adults, co-parents, couples, and multi-generational families. Through financial therapy and coaching, you can overcome anxiety, guilt or shame surrounding money, and develop financial literacy to achieve holistic success. With less stress around money management, you can spend more time focusing on the things that really matter, like spending time with the ones you love.",
    "previewblurb": "Transform your relationship with money to enhance life and strengthen family connections!",
    "profileurl": "/experts/Maureen.jpeg"
  },
  {
    "id": 8,
    "name": "Tyana Ingram",
    "title": "Financial Social Worker",
    "bookingurl": "https://calendly.com/tingram-xdc/financial-wellness-counsulting",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Financial Healing, Mindset, Financial Wellness",
    "certifications": "ASW (Associate Clinical Social Worker), CFSW (Certified Financial Social Worker), CFEI (Certified Financial Educational Instructor)",
    "song": "\"Optimistic\" by Sounds of Blackness",
    "yoe": 10,
    "clientele": "Underserved communities. Professionals. Low-middle income. Women entrepreneurs. Domestic violence survivors. Christian.",
    "longbio": "Tyana Ingram is the CPO and Co-Founder of the Financial Social Work Collaborative™ and is the Founder of Financial Healing Circles™, a financial wellness business that empowers underserved communities to heal their money wounds and achieve financial peace of mind. Her mission is to disrupt the cycle of money trauma utilizing the Financial Social Work framework combined with a mind-body-soul approach to deliver financial wellness services. She is an Associate Clinical Social Worker, Certified Financial Social Worker, and Financial Education Instructor based out of California and has dedicated her career to equipping people with the tools they need to live their best lives.",
    "previewblurb": "Empowering communities to heal money wounds and achieve financial peace through holistic wellness!",
    "profileurl": "/experts/TyanaIngram.jpeg"
  },
  {
    "id": 9,
    "name": "Vince Hollerman",
    "title": "Financial Coach",
    "bookingurl": "https://app.acuityscheduling.com/schedule.php?owner=19539981&appointmentType=88480714",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Budgeting, Saving, Credit, Investing",
    "certifications": "Certified Financial Coach - Previously investment and life insurance licensed. (No longer holds licenses)",
    "song": "nan",
    "yoe": 8,
    "clientele": "I work with ambitious professionals and entrepreneurs who make good money… but don't have much to show for it. You're my kind of client if: You’re earning more than ever, but feel like your money has no real structure or direction. You’re tired of wondering where your paycheck went and want a clear plan for saving, investing, and growing wealth. You’ve outgrown basic budgeting advice and need personalized strategies that actually match your income. You’re ready to build systems that automate your finances so you can focus on living, not stressing. You want support from someone who gets it and can help you fast-track your financial goals without judgment.",
    "longbio": "Vince Hollerman, Coach Vince, specializes in making money feel simple, actionable, and empowering. He combines expert guidance with practical strategy to help you take control of your finances without the overwhelm. He doesn’t just teach money, he helps you live a better life with it by aligning your financial strategy with your wellness, mindset, and lifestyle goals. With over 600,000 followers and supporters across social media, Vince has built a successful online Financial Education & Coaching Platform called IAmYourMoneyCoach.com that impacts and transforms the finances of those looking to take back control of their money.",
    "previewblurb": "Empowering millennials to achieve financial freedom through mindset shifts and effective money systems!",
    "profileurl": "/experts/vince.jpg"
  },
  {
    "id": 10,
    "name": "Jaelyn Vickery",
    "title": "Financial Therapist & Wealth Coach",
    "bookingurl": "https://calendly.com/dimensionalwealth/networking-x-dimensional-wealth",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Eating Disorders, Retail Therapy, Relationships, Consumer Psychology",
    "certifications": "B.A. Liberal Arts & Sciences: Psychology, M.S. Social Work: Healthcare/Mental Health,  LSW: Licensed Social Worker, Certified Integrated Behavioral Health Technician,  Dimensions of Wellness Educator, Financial Therapist",
    "song": "\"You Make My Dreams\" by Hall & Oates",
    "yoe": 2,
    "clientele": "I work with individuals, couples, and families looking to better understand the patters behind WHY they spend, save, or restrict their consumption habits. Consumption includes money, food, validation, and more.",
    "longbio": "Do you find yourself questioning why you never seem to be able to balance everything life requires of you? I'm Jae, and I'm dedicated to helping you build your wealth with wellness. This means not compromising you health for your wealth. I help you establish a momentum mindset, encouraging actionable steps toward abundance and longevity rather than waiting on fleeting motivation. With extensive experience researching and working in eating disorder therapy, I've explored the complex relationship between eating disorders and financial strain. I particularly enjoy working with individuals who seek a higher understanding of themselves and value the accountability to embrace the challenge of building and sustaining new habits. I'm dedicated to helping you break free from the cycle of compulsion, consumption, and control. My straightforward, compassionate accountability approach brings purpose and progress to every conversation. In my free time, I embrace free movement through exercise, explore nature with my dog Bibble, and indulge my love for art. A devoted plant mom and chess enthusiast, I bring creativity and strategy to everything I do.",
    "previewblurb": "Empowering holistic wealth and wellness through financial therapy and mindset transformation!",
    "profileurl": "therapists/jaelyn-vickery.jpg"
  },
  {
    "id": 14,
    "name": "Haylie Castillo",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/hayliecastillo/20-minute-intital-consultation",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Financial Trauma, Psychotherapy, Money Shame, Anti-Capitalism",
    "certifications": "Certified Financial Therapist™ Professional, LSWAIC; MSW; Currently pursuing the Trauma of Money™ Professional Certification",
    "song": "\"All I Know So Far\" by Pink",
    "yoe": 2,
    "clientele": "Individual adults. Women + Gender expansive people. Clients who feel they make \"enough\" money, have tried all the budgeting advice, but still struggle with complicated feelings about money and success. Clients who align with anti-oppressive values and aren't sure how money fits into their value system.",
    "longbio": "Hi! I'm Haylie (she/her). My mission is to help people heal their relationship with money so that they can create the life they truly want to live. I am passionate about helping people reclaim freedom and agency over their lives, and I believe a crucial part of that is having a healthy relationship with money. As a financial therapist, I help people work through their financial trauma and shift their negative emotions around money. I support them in building a healthy relationship with money by relearning how to have a healthy relationship with themselves. Then, through personalized financial education and coaching, I will help you create a money practice that is realistic and aligned with your values and goals. My clients end their work with me feeling at ease with their finances and with the confidence and clarity to use money as a resource to nourish the life I want to live. You deserve to have a relationship with money that gives you confidence and joy. You can have a relationship with money that is peaceful, empowering, and allows you to nourish the life and world you want to create. If this is you, schedule your free consultation and let's chat!",
    "previewblurb": "Heal your money mindset, reclaim your freedom, and live your dreams!",
    "profileurl": "/experts/HaylieCastillo.jpg"
  },
  {
    "id": 15,
    "name": "Sarah Carr",
    "title": "Financial Therapist",
    "bookingurl": "https://sarahcarr.as.me/schedule.php",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Investment education, Debt, Bubgeting, Saving",
    "certifications": "Certified Financial Planner (TM), Certified Financial Therapist (TM)",
    "song": "\"Got It In You\" by Banners",
    "yoe": 10,
    "clientele": "Mid 20s, 30s, 40s, and 60-70s. Income level varies.",
    "longbio": "Using financial therapy tools we explore how and why one relates to money the way they do. We look at how beliefs, values, and money histories shape financial decisions and work toward aligning one's resources with the life they are creating. We also work on communication skills when it comes to expressing financial concerns and needs. The work often includes creating a financial snapshot, establishing new spending patterns, and learning techniques to improve goal setting and achievement. I can provide investment education and advice as well. My base session rate is $120 an hour. I also provide packages of services. My most common package includes three personalized one-on-one sessions with financial planning/analysis (financial snapshot, cash flow review, debt analysis, goal setting, etc), and that is typically $540. I can create custom packages and can offer a sliding scale when necessary. I also offer payment plans, typically dividing the cost over the number of sessions. I can offer investment management (though I only do that in select cases where it makes sense for the client), that fee is an asset under management fee typically of 1.5%",
    "previewblurb": "Transforming financial wellness through compassionate guidance and personalized money healing!",
    "profileurl": "/experts/Sarah_Carr_Headshot.jpeg"
  },
  {
    "id": 16,
    "name": "LaQueshia Clemons",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/lclemonslcsw/meeting",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Financial Therapy, Social Work",
    "certifications": "LCSW, AFC",
    "song": "\"Unbreakable\" by Alicia keys",
    "yoe": 8,
    "clientele": "Female, 35, African American. Might be married with children. Has a degree. Makes good money but not sure where it goes.",
    "longbio": "LaQueshia Clemons is a LCSW, Trauma of Money Certified, and Financial Counselor, who guides individuals and couples towards financial well-being and emotional resilience. As the founder of Freedom Life Therapy and Wellness, she helps clients explore money-related emotional and behavioral patterns. Through engaging workshops and speeches, LaQueshia empowers others to understand their unique money stories, emphasizing the profound influences shaping financial decisions. Featured in media outlets like Word in Black, Nerd Wallet, and Yahoo Finance, her dynamic and warm approach transforms lives and fosters healthy money relationships. Outside work, LaQueshia enjoys cooking, adding zest to life through culinary adventures.",
    "previewblurb": "Heal your money mindset, empower your future, and savor life's journey!",
    "profileurl": "/experts/LaQueshiaClemons.jpeg"
  },
  {
    "id": 17,
    "name": "Kelly Reddy-Heffner",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/kelly-steelcitywc/hello-renavest",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Life transition guidance, Combining finances with a Partner, Student loan strategies, Divorce planning, Loss of a loved one planning, Accountability Coaching, Budgeting, Money and behavior, Goal setting and measuring, Building good money habits, Negotiation strategies",
    "certifications": "CFP®, CDFA®, CSLP®, CFT™, MBA, additional certificate in Strategic Negotiation",
    "song": "\"Lean on Me\" by Bill Withers",
    "yoe": 8,
    "clientele": "Trend toward early career to pre-retirement and encountering some type of life transition. A financial planner and therapist merging expert financial advice and numbers with empathetic and energetic financial guidance during a time of increased stress.",
    "longbio": "Kelly Reddy-Heffner, CFP®, CDFA®, CSLP®, CFT™, MBA is a CERTIFIED FINANCIAL PLANNER® professional, a Certified Divorce Financial Analyst® practitioner, Certified Financial Therapist™ and Certified Student Loan professional®. Kelly is also a trained Mediator.  Life credentials include growing up in a home with a divorced single mom who worked miracles with limited financial resources available. As a female business owner, I understand the challenges of navigating those responsibilities along with being a partner, mom, sister and daughter and thriving despite my own student loan debt, multiple PCS moves as a military service member household, paying for college education for children and daily life twists and turns.",
    "previewblurb": "Empowering financial journeys through expertise, empathy, and life experience!",
    "profileurl": "/experts/Kelly_Reddy_Heffner.jpeg"
  },
  {
    "id": 18,
    "name": "George Blount",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/georgeblount",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Financial Therapy, Financial Education, Coaching, Motivational Interviewing, Positive Psychology, Behavioral Finance",
    "certifications": "Doctorate",
    "song": "\"Scenario\" by Tribe Called Quest",
    "yoe": 25,
    "clientele": "Professionals of color earning between $75,000 and $150,000.",
    "longbio": "Dr. George M. Blount is a financial therapist, the Founder of nBalance Financial, and a researcher of finance's emotional, psychological, behavioral, and relational elements. Dr. Blount is also an accomplished educator, serving as an Adjunct Professor and Lecturer in Personal Finance, Finance, Managerial Accounting, and Behavioral Finance at several universities. He holds a Doctor of Business Administration (DBA) and an MBA from Walden University, as well as a Bachelor of Science (BS) and an Associate of Science (AS) from Johnson and Wales University. Dr. George Blount has spent over 20 years in the financial services industry, obtaining a wealth of knowledge in retirement planning, business development, and strategy. He served on the MA Financial Literacy Task Force in 2015, appointed by MA Treasurer Deb Goldberg, and was named one of the top 100 people of Finance 2020, an award by Top 100 magazine. TEDx Talk: https://youtu.be/KSCAuHC1-P4",
    "previewblurb": "Transforming financial wellness through emotional intelligence and strategic money mindset!",
    "profileurl": "/experts/GeorgeBlount.jpg"
  },
  {
    "id": 21,
    "name": "Nathan Astle",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/admin-yvmw/initial-consultation",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Healing financial trauma, Helping couples with financial conflict, Facilitating discussions with parent/child money issues",
    "certifications": "M.S. in Couples and Family Therapy, Certified Financial Therapist",
    "song": "\"Sweet Emotion\" by Aerosmith",
    "yoe": 8,
    "clientele": "I work with all ages, income levels, and am LGBTQ+ affirming. My specialty is with couples, but work with individuals and families often. I believe in making services as affordable as possible which is why I offer a sliding fee option.",
    "longbio": "Nate Astle is the CEO and Founder of the Financial Therapy Clinical Institute. He is a Marriage and Family Therapist and Certified Financial Therapist. He specializes in couples, emotions and money, and financial trauma. He has served as a past board member of the Financial Therapy Association, and has been featured in numerous outlets like the New York Times, Wall Street Journal, CNBC, USA Today, and TD Ameritrade.",
    "previewblurb": "Transforming financial struggles into healing through compassionate, expert relationship guidance!",
    "profileurl": "/experts/NathanAstle.jpg"
  },
  {
    "id": 23,
    "name": "Rebecca Pino",
    "title": "Financial Therapist",
    "bookingurl": "https://tidycal.com/rebeccarosepino/coffee-and-a-second-opinion",
    "demourl": "",
    "therapist_email": "",
    "expertise": "Financial coaching, Personalized advising, Curated money tools, Confidence building, Values-based spending guidance",
    "certifications": "Licensed Financial Advisor, Behavioral Financial Advisor and working on getting my CFT. https://brokercheck.finra.org/individual/summary/7831049",
    "song": "“Stronger” by Kelly Clarkson Because working with me is all about turning challenges into confidence, transforming shame into clarity, and walking away more empowered than you came in. Every session is designed to build your financial strength—not just in dollars, but in mindset, systems, and self-belief.",
    "yoe": 3,
    "clientele": "Women 22–45 in career or life transition $50K–$150K income; some irregular earners Carrying debt or rebuilding savings  U.S. remote Goals: debt-free, savings, investing, confidence Challenges: shame, overwhelm, inconsistency First-gen wealth builders Crave judgment-free, values-aligned coaching",
    "longbio": "Rebecca Pino is a financial advisor, behavioral money coach, and the founder of Money Her Way—a financial literacy platform and coaching community built by women, for women. With a background in finance, an MBA, and a passion for helping others, Rebecca blends traditional financial planning with behavioral psychology to help women transform their relationship with money. She works with clients 1:1 and in group settings to uncover the emotions and patterns behind financial decisions—empowering them to build wealth, confidence, and systems that actually work for their lives. Through Money Her Way, Rebecca is on a mission to make financial education more accessible, emotionally intelligent, and personalized. The platform offers digital resources, live events, coaching programs, and community support for women who are ready to stop avoiding money and start leading their financial lives with purpose. Whether she’s breaking down investment basics, helping someone heal from financial shame, or guiding a client through budgeting in a way that feels aligned with their values, Rebecca meets people where they are—and helps them move forward, one decision at a time.",
    "previewblurb": "Transforming challenges into confidence through empowering financial education and coaching!",
    "profileurl": "/experts/RebeccaPino.jpg"
  }
]