[
  {
    "id": 1,
    "name": "Paige Williams",
    "title": "Financial Coach",
    "bookingurl": "https://calendly.com/paigevic98/one-on-one",
    "demo_url": "",
    "expertise": "Debt Management, Saving, Investing",
    "certifications": "Bachelor’s Degree in Biopsychology, Master’s Degree in Medical Sciences – Liberty University (2022), Founder of the Millennium Money Master Program, Helped over 100 clients",
    "song": "Upgrade U\" by Beyonce",
    "yoe": 8,
    "clientele": "Early to mid-career professional women in their mid-20s and 30s who are looking to build long-term wealth. Income Level: Annual incomes ranging from $40,000 to $100,000. Occupation: A mix of salaried professionals, entrepreneurs, and freelancers. Challenges: Struggle with balancing short-term wants and long-term goals, navigating credit, and establishing clear financial systems.",
    "longbio": "I'm a passionate Money Coach and Online Content Creator dedicated to empowering women to take full control of their finances and build long-term wealth. In just 5 months, I paid off $3,000 in credit card debt, saved $5,000 in an emergency fund, and invested $10,000—all while juggling grad school and part-time jobs. This transformation inspired me to create the Millennium Money Master Program, a high-impact coaching program that has helped over 100 clients achieve financial confidence through crushing debt, investing, and strategic money management. My mission is to make personal finance fun, attainable, and attractive while inspiring others to take action, no matter where they’re starting",
    "previewblurb": "Empowering women to crush debt, invest smartly, and build lasting financial confidence!",
    "profileurl": "/experts/PaigeW.jpg"
  },
  {
    "id": 2,
    "name": "Constance McConnell",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/constance-courage2heal/30min",
    "demo_url": "",
    "expertise": "Major life and financial changes, Budgeting",
    "certifications": "Licensed Clinical Social Worker, Certified Financial Social Worker, Therapist",
    "song": "Golden\" by Jill Scott",
    "yoe": 10,
    "clientele": "20-65 years old. Historically marginalized populations (Black Latinx Native American Women LGBTQ+ communities). Identify with the upper-middle socioeconomic class. Doesn't mind telling their story via mindful journaling.",
    "longbio": "Constance is a LCSW, author, business owner, financial therapist and creative who specializes in working with individuals who are experiencing major life and financial changes. She is also a certified financial social worker and helps clients who want to improve their relationship with money. Constance is the author of a guided journal called, \"My Very Own Affirming Guided Journal A-Z” and launched a t-shirt line with designs that feature positive affirmations. She has practiced for 12 years and most of her clients are a part of the BIPOC and LGBTQ+ communities. Constance has been a featured professional guest on the following podcasts and media platforms: “Personal Finance with Leila”, “Budget Simple” “SocialWorkerRants” “AboutthatWallet”and “FIRE Social Worker.”",
    "previewblurb": "A financial therapist and author, enhancing relationships with money through empowerment!",
    "profileurl": "/experts/Constance.jpg"
  },
  {
    "id": 3,
    "name": "Michele Paiva",
    "title": "Financial Therapist",
    "bookingurl": "https://calendar.google.com/calendar/u/0/appointments/schedules/AcZssZ0UFT_d-qD0-vrKP3zy6VUZvFptyZgGjKVAzCqySKNKqezQ0kVMB4PualxwcyGkK1jXnbzYRB9K",
    "demo_url": "",
    "expertise": "Business Management, Family Planning, Couples, Clinical Autism Specialist",
    "certifications": "Licensed Psychotherapist specializing in Trauma and Financial Therapy, Certified Clinical Autism Specialist, Certified Financial Educator, Certified Financial Social Worker, Lifestyle Science Certified, Certified Clinical Meditation (Through University of Mass)",
    "song": "Ain't Misbehavin\" by Fats Waller",
    "yoe": 10,
    "clientele": "21 - 55. Mid Income. Millennials enjoy that I've been there, done that, and lived to tell; older clients appreciate that I've already put children through college, invested in property, etc., beyond \"just getting out of debt\" etc.",
    "longbio": "Michele Paiva is a financial therapist, trauma therapist, fractional CMO, and publicist with over 30 years of experience helping individuals and businesses thrive. Millennials value her relatable, \"I’ve been there\" approach, while Boomers appreciate her wisdom from successfully living through life’s financial challenges. Michele’s work focuses on uncovering the emotions beneath financial struggles, resolving couples' money conflicts, and empowering clients to showcase their value, build abundance, and create lasting change. Michele has autism and is also a certified clinical autism specialist who enjoys helping neurodivergent employees regain their feelings and finances. In 2023, she was voted top 100 publicists out of 14,000. She likes Tofu.",
    "previewblurb": "A casual approach to emotional depth and elegant living!",
    "profileurl": "/experts/Michele.jpeg"
  },
  {
    "id": 4,
    "name": "Justin DeFoor",
    "title": "Financial Coach",
    "bookingurl": "https://calendly.com/tgcfinancialgroup",
    "demo_url": "",
    "expertise": "Budgeting, Savings, Growth, Credit, Tax Planning",
    "certifications": "MBA, Certificate in Life Coaching, Life Insurance License",
    "song": "You Will Win\" by Jekalyn Carr",
    "yoe": 5,
    "clientele": "18-50. Income from $18,000 to $100,000. Any ethnicity and background.",
    "longbio": "I started my entrepreneur lifestyle as a business consultant. After about a year I entered into the financial services industry to help more people. I believe my purpose is to help people become financially free and create generational wealth. Through this I have helped a lot of individuals and families build the lifestyle that they want by understanding the fundamentals of finance and creating good financial habits that will benefit them and their children. I've been in this industry for 5 years and now look to build people mentally, emotionally, physically, spiritually, and financially to walk in balance while living in purpose in every area of their lives.",
    "previewblurb": "Empowering financial freedom and generational wealth for all!",
    "profileurl": "/experts/JustinD.jpeg"
  },
  {
    "id": 5,
    "name": "Aitzarelys Negrón",
    "title": "Financial Coach",
    "bookingurl": "https://StrategiesandTEA.as.me/?appointmentType=72189521",
    "demo_url": "",
    "expertise": "Entrepreneurship, Paycheck to purpose, Mindset shifts, Money audits, Bugeting, Business Bookkeeping, Business essentials, Profit Management, Debt Management, Burnout, Cash Flow",
    "certifications": "Certified Public Accountant (CPA), QuickBooks Online Certified, ProAdvisor, Accredited Financial Counselor (Studying/In Process)",
    "song": "Level Up\" by Ciara",
    "yoe": 10,
    "clientele": "25–45 years old. Professionals Aspiring entrepreneurs. Income: $70,000–$150,000+.",
    "longbio": "Aitza is a passionate financial coach, accountant, and entrepreneur dedicated to helping professionals and aspiring business owners achieve financial clarity and time freedom. With a background as a CPA and years of experience in personal finance and business management, she empowers her clients to bridge the gap between their current reality and their ideal lifestyle. Aitza’s journey into financial coaching was inspired by her own transformational story—turning her life around in high school with the support of a mentor, she now dedicates her career to helping others see possibilities and take control of their futures. Her coaching program, moneyFLOW$™ Academy, guides high-earning professionals through mastering personal finances, reducing debt, and building sustainable businesses. In addition to coaching, Aitza specializes in bookkeeping, bookkeeping diagnostics, Profit First implementation, and financial clean-ups, ensuring business owners have the tools they need for long-term profitability. Her clients have achieved remarkable results, from saving thousands of dollars to confidently launching businesses that align with their goals and values. Aitza’s mission is to create financial confidence and economic resilience for her clients, equipping them to build wealth and lead change for themselves, their families, and their communities.",
    "previewblurb": "Transforming finances, empowering dreams, and creating lasting wealth!",
    "profileurl": "/experts/Aitzarelys.jpeg"
  },
  {
    "id": 6,
    "name": "Maureen Kelley",
    "title": "Financial Therapist",
    "bookingurl": "https://maureenkelley.com/contact/",
    "demo_url": "",
    "expertise": "Family, Wealth Management, Positive Psychology",
    "certifications": "BS, University of Rhode Island Graduate Cert Financial Therapy, Kansas State Univ Executive Women's Leadership, The Wharton School - Certification Applied Positive Psychology, Univ of Penn Certified Financial Therapist (CFT), Certified Financial Behavior Specialist (FBS), Accredited Wealth Management Advisor (AWMA), Certified Family Wealth Advisor (CFWA), Certified Family Coach(CFC), Certified Co-Parenting Specialist",
    "song": "You've Got a Friend In Me\" by Randy Newman",
    "yoe": 10,
    "clientele": "People from all walks of life. Young adults individuals co-parents couples and families. She has helped those who struggle with making ends meet people navigating divorce issues to multi-generational complex families of wealth.",
    "longbio": "Maureen Kelley has more than 30 years’ experience helping families navigate the complex intersection of economics and emotions. As a seasoned family dynamics coach and family wealth consultant, she’s dedicated to creating a safe space for you to share the ups and downs of your financial journey. Maureen works to dismantle the stigma surrounding these conversations, making hard-to-talk-about topics a lot easier. Having held senior positions at financial institutions like BOK Financial Private Wealth and Wells Fargo Private Bank, Maureen offers years of expertise in wealth management and positive psychology, helping you improve your financial life by improving your relationship with yourself and your loved ones. Working with Maureen, you’ll rewrite your “money scripts”—the narratives we develop around wealth in childhood—and better understand how your past shapes your present views on money. As the founder of a family dynamics and financial coaching practice, Maureen’s dedication to family is evident. Her services have been utilized by people of all walks of life, including young adults, co-parents, couples, and multi-generational families. Through financial therapy and coaching, you can overcome anxiety, guilt or shame surrounding money, and develop financial literacy to achieve holistic success. With less stress around money management, you can spend more time focusing on the things that really matter, like spending time with the ones you love.",
    "previewblurb": "Transform your relationship with money to enhance life and strengthen family connections!",
    "profileurl": "/experts/Maureen.jpeg"
  },
  {
    "id": 7,
    "name": "Tiffany Grant",
    "title": "Financial Coach",
    "bookingurl": "https://calendly.com/moneytalkwitht/coaching",
    "demo_url": "",
    "expertise": "Personal Finance, Side hustles, Business growth, Money Management",
    "certifications": "MBA, AFC, SHRM-CP",
    "song": "Lean on Me\" by Bill Withers",
    "yoe": 8,
    "clientele": "25-45 any gender. Income up to $150,000. Looking for help with budgeting and goal setting.",
    "longbio": "Tiffany Grant, AFC®, is a dedicated Accredited Financial Counselor, sought-after speaker, and founder of Money Talk With Tiff. Renowned for her ability to make personal finance approachable and relatable, Tiffany has made significant contributions as a financial educator, coach, blogger, and podcaster. Her expert advice on side hustles, business growth, and money management has been featured on platforms like Forbes, CNBC, Yahoo Finance, Business Insider, MSN, and ESSENCE. Tiffany's passion lies in empowering others to gain control over their finances through practical education and down-to-earth insights. Her engaging style and actionable guidance have helped countless individuals build financial confidence and clarity. Beyond her professional accolades, Tiffany’s academic background includes a Bachelor of Business Administration and Management from the University of North Carolina at Pembroke and a Master of Business Administration (MBA) from the University of North Carolina at Greensboro. She also holds the SHRM-CP credential and is a certified Lean Six Sigma Yellow Belt, reflecting her diverse expertise and dedication to continuous learning.",
    "previewblurb": "Empowering financial freedom through practical education and relatable money management insights!",
    "profileurl": "/experts/TiffanyGrant.jpeg"
  },
  {
    "id": 8,
    "name": "Tyana Ingram",
    "title": "Financial Social Worker",
    "bookingurl": "https://calendly.com/tingram-xdc/financial-wellness-counsulting",
    "demo_url": "",
    "expertise": "Financial Healing, Mindset, Financial Wellness",
    "certifications": "ASW (Associate Clinical Social Worker), CFSW (Certified Financial Social Worker), CFEI (Certified Financial Educational Instructor)",
    "song": "Optimistic\" by Sounds of Blackness",
    "yoe": 10,
    "clientele": "Underserved communities. Professionals. Low-middle income. Women entrepreneurs. Domestic violence survivors. Christian.",
    "longbio": "Tyana Ingram is the CPO and Co-Founder of the Financial Social Work Collaborative™ and is the Founder of Financial Healing Circles™, a financial wellness business that empowers underserved communities to heal their money wounds and achieve financial peace of mind. Her mission is to disrupt the cycle of money trauma utilizing the Financial Social Work framework combined with a mind-body-soul approach to deliver financial wellness services. She is an Associate Clinical Social Worker, Certified Financial Social Worker, and Financial Education Instructor based out of California and has dedicated her career to equipping people with the tools they need to live their best lives.",
    "previewblurb": "Empowering communities to heal money wounds and achieve financial peace through holistic wellness!",
    "profileurl": "/experts/TyanaIngram.jpeg"
  },
  {
    "id": 9,
    "name": "Vince Hollerman",
    "title": "Financial Coach",
    "bookingurl": "https://app.acuityscheduling.com/schedule/8d3ad975",
    "demo_url": "",
    "expertise": "Previously investment and life insurance licensed. (No longer holds licenses)",
    "certifications": "Previously investment and life insurance licensed. (No longer holds licenses)",
    "song": "nan",
    "yoe": 8,
    "clientele": "25-45 year olds. 50/50 Male to Female. Income level: $50,000+. 9-5 Professionals Small Business Owners.",
    "longbio": "Vince Hollerman, Coach Vince, is a Money Coach & Digital Creator specializing in helping millennials sort or their finances and stream line their path to financial freedom. He focuses on instilling great money habits for saving, budgeting & investing by developing your money mindset and putting money systems into place to help you reach your financial goals. With over 600,000 followers and supporters across social media, Vince has built a successful online Financial Education & Coaching Platform called IAmYourMoneyCoach.com that impacts and transforms the finances of those looking to take back control of their money.",
    "previewblurb": "Empowering millennials to achieve financial freedom through mindset shifts and effective money systems!",
    "profileurl": "/experts/vince.jpg"
  },
  {
    "id": 10,
    "name": "Jaelyn Vickery",
    "title": "Financial Therapist",
    "bookingurl": "https://outlook.office.com/bookwithme/user/dbdc3761a936461793e506df25358b91%40illinois.edu/meetingtype/_T3Sy3d-XkuptOwOzGAk-A2?bookingcode=3c26242c-7647-4395-9aea-135ffebbf651&anonymous&ismsaljsauthenabled=true",
    "demo_url": "",
    "expertise": "Dimensional Wealth, Holistic abundance, Financial empowerment, Financial Therapy, Mindset",
    "certifications": "B.A. Liberal Arts & Sciences, Psychology M.S. Social Work, Healthcare/Mental Health LSW, Licensed Social Worker, Certified Integrated Behavioral Health Technician, 8 Dimensions of Wellness Guidebook Author (UIUC), CFT-I - Certified Financial Therapist *In Process, AFC - Accredited Financial Counselor *In Process",
    "song": "You Make My Dreams\" by Hall & Oates",
    "yoe": 1,
    "clientele": "Aged 18-45 who are navigating life transitions. Diverse genders. Diverse, income levels, and backgrounds.",
    "longbio": "Jaelyn (Jae) Vickery is a dynamic force in the world of holistic wellness and financial empowerment. As a financial therapist, entrepreneur, and creator of the acclaimed podcast Finance Fitness Finesse, Jae is dedicated to helping individuals build their wealth with wellness. Through her business, Dimensional Wealth LLC, she champions a momentum mindset—encouraging actionable steps toward abundance and longevity rather than waiting on fleeting motivation. With extensive experience researching and working in eating disorder therapy, Jae has explored the complex relationship between eating disorders and financial strain. She particularly enjoys working with individuals who seek a higher understanding of themselves and value the accountability to embrace the challenge of building and sustaining new habits. Jae is dedicated to helping individuals break free from the cycle of compulsion, consumption, and control. Jae’s straightforward compassionate accountability approach brings purpose to every conversation to help her network diversify their knowledge portfolios. She’s here to help you connect the dots between wealth and wellness and isn’t afraid to tell you why “you’re not woke, you’re broke.” In her free time, Jae embraces free movement through exercise, explores nature with her dog Bibble, and indulges her love for art. A devoted plant mom and chess enthusiast, she brings creativity and strategy to everything she does.",
    "previewblurb": "Empowering holistic wealth and wellness through financial therapy and mindset transformation!",
    "profileurl": "/experts/jaelyn.jpg"
  },
  {
    "id": 11,
    "name": "Shani Tené",
    "title": "Financial Coach",
    "bookingurl": "https://shanitene.com/levelup",
    "demo_url": "",
    "expertise": "Budgeting, Saving, Investing, Debt reduction",
    "certifications": "nan",
    "song": "Stronger Together",
    "yoe": 10,
    "clientele": "Millennials & Gen X Middle Class Females",
    "longbio": "Shani Tené is a passionate Money Coach, financial educator and speaker, dedicated to helping individuals achieve financial freedom through a faith-inspired approach. Merging extensive financial knowledge with spiritual principles, Shani empowers clients to enhance their income, manage debt, and invest wisely, ensuring their financial goals reflect their personal values. Her holistic strategy not only boosts financial health but also fosters spiritual richness, guiding clients towards sustainable wealth and true independence.",
    "previewblurb": "Empowering financial freedom through faith-based coaching and holistic money management!",
    "profileurl": "/experts/ShaniT.jpg"
  },
  {
    "id": 12,
    "name": "BreAnna Bassett",
    "title": "Financial Social Worker",
    "bookingurl": "https://calendly.com/bplummer-consciouschoicestherapy",
    "demo_url": "",
    "expertise": "Money Mindset, Budgeting, Saving, Debt",
    "certifications": "Licensed Master Social Worker (LMSW), Certified Financial Social Worker (CFSW), Certified Domestic Violence Specialist Level 1 (CDVSI)",
    "song": "One Step At A Time\" by Jordan Sparks",
    "yoe": 9,
    "clientele": "Age 30-45 who identify as BIPOC. Income levels range from $100,000-$300,000 annually. No guidance or support in improving financial stability and saving habits. Symptoms such as stress depression PTSD and anxiety = main money concern.",
    "longbio": "I have been a clinical social worker and advocate for wellness for 9 years. I earned my BSW (2015) and MSW (2017) from Wayne State University. Over my career I have worked with families of Head Start, survivors of crime, survivors of homelessness and financial trauma, planned community events for survivors and managed programs for suicide prevention. I became a certified financial social worker in August 2024. The highs and lows of my own financial journey led me to practice financial social work. I utilize my skills and professional expertise to help clients gain mental and financial stability through one-on-one support. Working to help individuals have less stress and anxiety about money while decreasing their debt and increasing their savings is my passion. In our 45-60 minute one on one sessions, clients will gain holistic and practical tools to transform into a mindful money manager!",
    "previewblurb": "Empowering mental and financial stability through holistic 1on1 support and practical tools!",
    "profileurl": "/experts/BreAnnaBassett.jpg"
  },
  {
    "id": 13,
    "name": "Monica Bradshaw",
    "title": "Financial Coach",
    "bookingurl": "https://form.jotform.com/251407519525154",
    "demo_url": "",
    "expertise": "Wealth building, Retirement",
    "certifications": "Certified Financial Coach, Certified Trauma Coach",
    "song": "Titanium\" by David Guetta",
    "yoe": 3,
    "clientele": "45 - 60 years old. Sandwich generation. Household income $120k.",
    "longbio": "I began my career in 1994 at Paulson Investments and have since built a diverse background, including roles as a licensed stockbroker, real estate agent, trauma counselor, IT manager, certified Scrum Master, and bookkeeper. Despite high income and prestigious credentials, I found myself struggling financially, with no progress toward generational wealth and living paycheck to paycheck. After confronting my money trauma and mindset, I developed a transformational approach combining financial strategies with personal growth techniques. This led me to coach others, incorporating neuropsychology, manifestation, and assessments. I help people go beyond financial knowledge to achieve true transformation, enabling lasting success. My journey has been shaped by extensive study in areas like NLP, neuroscience, and wealth-building, and I now share my step-by-step method to help others achieve financial and personal bliss.",
    "previewblurb": "Transforming financial struggles into lasting success through holistic coaching and personal growth!",
    "profileurl": "/experts/MonicaB.jpeg"
  },
  {
    "id": 14,
    "name": "Haylie Castillo",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/hayliecastillo/20-minute-intital-consultation",
    "demo_url": "",
    "expertise": "Financial Trauma, Psychotherapy, Financial education, Coaching",
    "certifications": "Certified Financial Therapist™ Professional, LSWAIC; MSW; Currently pursuing the Trauma of Money™ Professional Certification",
    "song": "All I Know So Far\" by Pink",
    "yoe": 2,
    "clientele": "Women. Gender expansive individuals. Clients who feel they make \"enough\" money. Those who still struggle with complicated feelings about money and success.",
    "longbio": "Hi! I’m Haylie (she/her). My mission is to help people heal their relationship with money so that they can create the life they truly want to live. I am passionate about helping people reclaim freedom and agency over their lives, and I believe a crucial part of that is having a healthy relationship with money. As a financial therapist, I help people work through their financial trauma and shift their negative emotions around money. I support them in building a healthy relationship with money by relearning how to have a healthy relationship with themselves. We work together to redefine their concept of success, and identify financial goals that align with their values. My clients long to experience freedom and agency in their lives, and their relationship with money is the one area that they haven’t been able to figure out. Many of them have financial trauma holding them back from chasing their dreams. Our families, communities, and society at large hand us a lot of default beliefs about money and success, but these default beliefs no longer work for my clients. You may have looked into personal finance, but whether it’s impulsive spending, avoiding your bank statements, or grappling with indecisiveness, you still find yourself struggling and secretly wonder if you’ll ever feel good about money. Trying to navigate the complicated, overwhelming feelings of depression, shame, anger, or anxiety around money is exhausting. As both a financial coach and trained psychotherapist, I offer a unique experience to those who work with me. First, we will work together to define your beliefs about money and develop a healthy relationship with money. I provide a shame-free space to work through your emotions and psychology around money, and I will help you cultivate a healthy, positive money mindset. Then, through personalized financial education and coaching, I will help you create a money practice that is realistic and aligned with your values and goals. My clients end their work with me feeling at ease with their finances and with the confidence and clarity to use money as a resource to nourish the life they want to live. You deserve to have a relationship with money that gives you confidence and joy. You can have a relationship with money that is peaceful, empowering, and allows you to chase your dreams. If this is you, schedule your free consultation and let’s chat!",
    "previewblurb": "Heal your money mindset, reclaim your freedom, and live your dreams!",
    "profileurl": "/experts/HaylieCastillo.jpg"
  },
  {
    "id": 15,
    "name": "Sarah Carr",
    "title": "Financial Therapist",
    "bookingurl": "https://sarahcarr.as.me/schedule.php",
    "demo_url": "",
    "expertise": "Investment education, Debt, Bubgeting, Saving",
    "certifications": "Certified Financial Planner (TM), Certified Financial Therapist (TM)",
    "song": "Got It In You\" by Banners",
    "yoe": 10,
    "clientele": "Mid 20s 30s 40s and 60-70s. Income level varies.",
    "longbio": "Using financial therapy tools we explore how and why one relates to money the way they do. We look at how beliefs, values, and money histories shape financial decisions and work toward aligning one's resources with the life they are creating. We also work on communication skills when it comes to expressing financial concerns and needs. The work often includes creating a financial snapshot, establishing new spending patterns, and learning techniques to improve goal setting and achievement. I can provide investment education and advice as well. My base session rate is $120 an hour. I also provide packages of services. My most common package includes three personalized one-on-one sessions with financial planning/analysis (financial snapshot, cash flow review, debt analysis, goal setting, etc), and that is typically $540. I can create custom packages and can offer a sliding scale when necessary. I also offer payment plans, typically dividing the cost over the number of sessions. I can offer investment management (though I only do that in select cases where it makes sense for the client), that fee is an asset under management fee typically of 1.5%",
    "previewblurb": "Transforming financial wellness through compassionate guidance and personalized money healing!",
    "profileurl": "/experts/Sarah_Carr_Headshot.jpeg"
  },
  {
    "id": 16,
    "name": "LaQueshia Clemons",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/lclemonslcsw/meeting",
    "demo_url": "",
    "expertise": "Financial Therapy, Social Work",
    "certifications": "LCSW, AFC",
    "song": "Unbreakable\" by Alicia keys",
    "yoe": 8,
    "clientele": "Female 35 African American. Might be married with children. Has a degree. Makes good money but not sure where it goes.",
    "longbio": "LaQueshia Clemons is a LCSW, Trauma of Money Certified, and Financial Counselor, who guides individuals and couples towards financial well-being and emotional resilience. As the founder of Freedom Life Therapy and Wellness, she helps clients explore money-related emotional and behavioral patterns. Through engaging workshops and speeches, LaQueshia empowers others to understand their unique money stories, emphasizing the profound influences shaping financial decisions. Featured in media outlets like Word in Black, Nerd Wallet, and Yahoo Finance, her dynamic and warm approach transforms lives and fosters healthy money relationships. Outside work, LaQueshia enjoys cooking, adding zest to life through culinary adventures.",
    "previewblurb": "Heal your money mindset, empower your future, and savor life's journey!",
    "profileurl": "/experts/LaQueshiaClemons.jpeg"
  },
  {
    "id": 17,
    "name": "Kelly Reddy-Heffner",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/kelly-steelcitywc/hello",
    "demo_url": "",
    "expertise": "Life transition guidance, Combining finances with a Partner, Student loan strategies, Divorce planning, Loss of a loved one planning, Accountability Coaching, Budgeting, Money and behavior, Goal setting and measuring, Building good money habits, Negotiation strategies",
    "certifications": "CFP, CDFA, CSLP, CFT, additional certificate in Strategic Negotiation",
    "song": "Lean on Me\" by Bill Withers",
    "yoe": 8,
    "clientele": "Trend toward early career to pre-retirement and encountering some type of life transition. There is an appreciation for an empathetic and energetic professional to provide financial guidance during a time of increased stress.",
    "longbio": "Kelly is a CERTIFIED FINANCIAL PLANNER(TM) professional, Certified Student Loan professional (R), a Certified Divorce Financial Analyst (R) practitioner, and Certified Financial Therapist-1(TM). She maintains those credentials with annual continuing education programs to stay up to date and would consider herself a lifelong learner. Life credentials include growing up in a home with a single mom who worked miracles with financial resources available, business ownership, college funding and student loan survival, buying and selling property and cars, military service member household with multiple PCS moves, divorced family members and friends, life’s twists and turns.",
    "previewblurb": "Empowering financial journeys through expertise, empathy, and life experience!",
    "profileurl": "/experts/Kelly_Reddy_Heffner.jpeg"
  },
  {
    "id": 18,
    "name": "George Blount",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/georgeblount",
    "demo_url": "",
    "expertise": "Financial Therapy (with or without financial trauma) Financial Education, Coaching",
    "certifications": "Doctorate",
    "song": "Scenario\" by Tribe Called Quest",
    "yoe": 10,
    "clientele": "Generation X male or female. Earning between $75,000 and $150,000.",
    "longbio": "Dr. George M. Blount is a financial therapist, the Founder of nBalance Financial, and a researcher of finance's emotional, psychological, behavioral, and relational elements. Dr. Blount is also an accomplished educator, serving as an Adjunct Professor and Lecturer in Personal Finance, Finance, Managerial Accounting, and Behavioral Finance at several universities. He holds a Doctor of Business Administration (DBA) and an MBA from Walden University, as well as a Bachelor of Science (BS) and an Associate of Science (AS) from Johnson and Wales University. Dr. George Blount has spent over 20 years in the financial services industry, obtaining a wealth of knowledge in retirement planning, business development, and strategy. He served on the MA Financial Literacy Task Force in 2015, appointed by MA Treasurer Deb Goldberg, and was named one of the top 100 people of Finance 2020, an award by Top 100 magazine. TEDx Talk: https://youtu.be/KSCAuHC1-P4",
    "previewblurb": "Transforming financial wellness through emotional intelligence and strategic money mindset!",
    "profileurl": "/experts/GeorgeBlount.jpg"
  },
  {
    "id": 19,
    "name": "Tamoa Danielle Smith",
    "title": "Financial Therapist",
    "bookingurl": "https://api.leadconnectorhq.com/widget/booking/fQXXP7vrPawH8NQguqXR",
    "demo_url": "",
    "expertise": "Financial Therapy, Couples Financial Therapy, Corporate Financial Wellness Program, Emotional and practical financial support, Confidence building, Stress management",
    "certifications": "Licensed Clinical Mental Health Therapist",
    "song": "Unstoppable",
    "yoe": 10,
    "clientele": "Typically between 30 to 55 years old focused on individuals navigating significant life transitions such as marriage divorce or career changes which impact their financial stability. I predominantly serve female clients although my services are inclusive and beneficial to all genders with a focus on empowering women to take charge of their financial health especially post-divorce or during major life adjustments. The clients I work with range from middle to upper-middle class with annual incomes between $40,000 to $120,000 often in stages of rebuilding or enhancing their financial independence and security. Primarily based in suburban areas across the United States with a significant number located in the Southeast my clients are diverse in their careers including sectors like healthcare education and small business ownership. They seek to balance professional growth with financial stability and are particularly interested in financial therapy to address and heal from financial trauma develop healthier money management habits and secure their financial future.",
    "longbio": "Tamoa Danielle leads Clarity Kollective LLC, specializing in transformative financial therapy. As CEO, she empowers clients to overcome financial challenges and achieve sustainable wellness. Tamoa’s journey includes personal recoveries from two bankruptcies and overcoming significant financial trauma, which fuels her passion for helping others transform their financial lives. As a licensed clinical mental health therapist and financial therapist, Tamoa integrates the emotional and psychological aspects into money management. Her holistic approach addresses the root causes of financial trauma, fostering a healthier relationship with money and combining practical advice with emotional support at the critical intersection of finances and mental well-being. Additionally, Tamoa serves as a personal to business development coach on the LUHV Plus platform, assisting entrepreneurs in clearing mental clutter and transforming into effective leaders with renewed mindsets for achieving their personal and business goals. Tamoa also heads Renew You Consulting LLC as a Credit Restoration Specialist. In this role, she expertly guides clients through the complexities of credit restoration, helping them rebuild their credit profiles to regain financial stability. A dedicated speaker, consultant, and advocate for financial empowerment, Tamoa is committed to renewing financial outlooks and transforming lives. Catch Tamoa Danielle on her YouTube channel, Financial Therapy to Prosperity, where she explores the intricate relationship between emotions and finances, delving into financial therapy, trauma, and the journey towards financial prosperity.",
    "previewblurb": "Transforming financial trauma into empowerment through holistic healing and hope!",
    "profileurl": "/experts/TamoaDanielleSmith.jpeg"
  },
  {
    "id": 20,
    "name": "Jennifer Calder",
    "title": "Financial Therapist",
    "bookingurl": "https://jennifer-calder.clientsecure.me/request/date?currentDate=2025-11-01&currentTimeZone=America%2FNew_York",
    "demo_url": "",
    "expertise": "Individual and couples Financial Psychology Coaching, Inheritance Dynamics",
    "certifications": "Certified in Financial Psychology and Behavioral Finance, Masters in Social Work, Masters in Anthropology and Sociology",
    "song": "nan",
    "yoe": 10,
    "clientele": "New couples early career professionals individuals receiving inheritance and couples from diverse financial backgrounds seeking to navigate complex family wealth dynamics and parenting challenges.",
    "longbio": "I have been highlighted, featured, and interviewed in several news outlets: the Boston Globe, Women's World Daily, Seven Days, Fatherly, Vermont Edition, Healthy Love and Money. Jennifer holds a Masters degree in Sociology and Anthropology and a Masters degree in Social Work from the University of Vermont. In order to help people overcome and work through chronic financial stressors, Jennifer decided to extend her training with a graduate certificate program in Financial Psychology and Behavioral Finance from the Heider School of Business at Creighton University. From 2016-2018, as a student in the program, Jennifer was “the client” going through the process of addressing her own unconscious beliefs about money and connecting them to some of her unhelpful financial behaviors. She knows first-hand how addressing the psychology of money can improve wellbeing, relationships and financial security.",
    "previewblurb": "Transforming financial struggles into empowerment through personal healing and insight!",
    "profileurl": "/experts/JenniferCalder.jpeg"
  },
  {
    "id": 21,
    "name": "Nathan Astle",
    "title": "Financial Therapist",
    "bookingurl": "https://calendly.com/admin-yvmw/initial-consultation",
    "demo_url": "",
    "expertise": "Psychological aspects of financial life, Emotional relationship with money, Couples, Parents, Children, Family financial discussions, Mental health condition support, Trauma-informed financial healing, Communication barriers, Skill-based intervention",
    "certifications": "M.S. in Couples and Family Therapy, Certified Financial Therapist",
    "song": "Sweet Emotion\" by Aerosmith",
    "yoe": 8,
    "clientele": "I work with all ages, income levels, and am LGBTQ+ affirming. My specialty is with couples but work with individuals and families often. I believe in making services as affordable as possible which is why I offer a sliding fee option.",
    "longbio": "Nate Astle is the CEO and Founder of the Financial Therapy Clinical Institute. He is a Marriage and Family Therapist and Certified Financial Therapist. He specializes in couples, emotions and money, and financial trauma. He has served as a past board member of the Financial Therapy Association, and has been featured in numerous outlets like the New York Times, Wall Street Journal, CNBC, USA Today, and TD Ameritrade.",
    "previewblurb": "Transforming financial struggles into healing through compassionate, expert relationship guidance!",
    "profileurl": "/experts/NathanAstle.jpg"
  },
  {
    "id": 22,
    "name": "Simone Griffin Taylor",
    "title": "Financial Therapist",
    "bookingurl": "https://calendar.app.google/inZxzzQTvgA9khmb7",
    "demo_url": "",
    "expertise": "Homeownership, The Importance of Owning Your Decisions, Making Money From Your Home, Family Business, Building Financial Confidence",
    "certifications": "Certificate in Financial Therapy, Kansas State University; Certificate in Trauma of Money",
    "song": "Power by Kanye West",
    "yoe": 10,
    "clientele": "My clients are often making good money but also feel like they don't have enough and are ready for a change yet have no clue how to achieve it. Overall while they’re happy with what they have achieved they want more for their lives and may secretly wonder if everyone else has it together and they are the problem. This person is between mid-30s and mid-60’s; a female male or gender non-conforming; steadily employed (or self-employed); financially self-sufficient; has some debt; may have secondary income; has a strong desire to do or have “big” things whether that be money extensive travel a large house sending kids to college debt free start their own business or something else; if they’re married they may not be on the same money page as their spouse.",
    "longbio": "I Help People Who Are Stuck Reclaim Their Financial Power Hi, I'm Simone, and I believe your current money situation isn't your weakness—it's your superpower. Why I Do This Work I intimately understand what it feels like to be told your financial approach is wrong, or that you need to \"just do x\" or “stop doing y” to be financially successful. I spent years trying to force myself into a way of being that felt soul-crushing. I was told I was supposed to spend and save in certain ways “to be happy”, or would need to do different work - and spend many more hours working - just to make more money. This caused me to ignore my natural talents, make decisions based on other people’s timelines, and attempt hustling in ways that had no purpose beyond making other people rich. That went against every fiber of my being. The breakthrough came when I realized that my natural self wasn't a financial liability: it was my superpower. My need to feel into financial decisions over time wasn't inefficiency: it was wisdom. My sensitivity to the world around me and how I made money wasn't weakness: it was my guidance system.",
    "previewblurb": "Empowering you to reclaim your financial power and turn challenges into strengths!",
    "profileurl": null
  },
  {
    "id": 23,
    "name": "Rebecca Pino.",
    "title": "Financial Therapist",
    "bookingurl": "https://tidycal.com/rebeccarosepino/coffee-and-a-second-opinion",
    "demo_url": "",
    "expertise": "I provide financial coaching, advising, and curated tools through Money Her Way. Services support women in building confidence, aligning spending with their values, and making empowered money decisions. Offerings range from 1:1 advising to digital downloads and programs.",
    "certifications": "Licensed Financial Advisor, Behavioral Financial Advisor and working on getting my CFT. https://brokercheck.finra.org/individual/summary/7831049",
    "song": "“Stronger” by Kelly Clarkson Because working with me is all about turning challenges into confidence, transforming shame into clarity, and walking away more empowered than you came in. Every session is designed to build your financial strength—not just in dollars, but in mindset, systems, and self-belief.",
    "yoe": 3,
    "clientele": "Client Demographics: Money Her Way Age Range: Primarily women ages 22–45 with sub-groups including early-career professionals (22–30) women navigating major life transitions (30–45) and newly divorced or financially rebuilding women. Gender Identity: Predominantly women including cisgender women with growing inclusion of nonbinary and LGBTQ+ individuals seeking a safe and empowering financial space. Typical Income Level or Financial Profile: Most clients earn between $50,000 and $150,000/year though some are freelancers or creatives with inconsistent income. Many have student loans credit card debt or are building from zero savings. Others are beginning to accumulate wealth and want to build smarter systems invest consistently or plan for retirement. Occupations / Industries Represented: A mix of creative professionals educators consultants tech workers, entrepreneurs, and women in transition (e.g. leaving full-time jobs shifting careers or navigating divorce). Geographic Location: Primarily urban and metropolitan areas with a large concentration in New York City as well as remote clients across the U.S. who find Money Her Way online. Common Financial Goals: Paying off debt (student loans credit cards) Building consistent savings and emergency funds Creating an investment strategy for retirement and goals Aligning money systems with lifestyle and values Gaining the confidence to make financial decisions independently Planning for marriage children or future homeownership Common Financial Challenges: Shame and avoidance around money Lack of clarity on income and expenses Inconsistent or irregular income Overwhelm from too much advice and not enough guidance Struggles with impulse spending lifestyle creep or comparison Seeking validation or permission from partners before making financial decisions Anything else we should know? The Money Her Way client is smart ambitious and emotionally invested in doing better with money—but often hasn’t had the tools mentorship or community to get started. Many clients are the first in their families to build wealth or manage money intentionally. They crave relatable judgment-free education behavioral coaching and financial empowerment tailored to how women think feel and make decisions around money. This is comonly referred to as HENRY- High Earners Not Rich Yet",
    "longbio": "Rebecca Pino is a financial advisor, behavioral money coach, and the founder of Money Her Way—a financial literacy platform and coaching community built by women, for women. With a background in finance, an MBA, and a passion for helping others, Rebecca blends traditional financial planning with behavioral psychology to help women transform their relationship with money. She works with clients 1:1 and in group settings to uncover the emotions and patterns behind financial decisions—empowering them to build wealth, confidence, and systems that actually work for their lives. Through Money Her Way, Rebecca is on a mission to make financial education more accessible, emotionally intelligent, and personalized. The platform offers digital resources, live events, coaching programs, and community support for women who are ready to stop avoiding money and start leading their financial lives with purpose. Whether she’s breaking down investment basics, helping someone heal from financial shame, or guiding a client through budgeting in a way that feels aligned with their values, Rebecca meets people where they are—and helps them move forward, one decision at a time.",
    "previewblurb": "Transforming challenges into confidence through empowering financial education and coaching!",
    "profileurl": "/experts/RebeccaPino.jpg"
  },
  {
    "id": 24,
    "name": "Tony Ware",
    "title": "Financial Coach",
    "bookingurl": "https://calendar.google.com/calendar/u/0/appointments/schedules/AcZssZ0i0WBxZAVFZ6QFjOzwG6BxQ4rljV9oGRxEXnlgX5ampmkocOkkcD-kT2XzKqOqCZDmELg-vnsp",
    "demo_url": "",
    "expertise": "Budgeting, Debt management, Investing, Real estate",
    "certifications": "Certified 401(k) Plan Fiduciary and I've helped dozens of clients move from financial paralysis to competence and confidence.",
    "song": "New financial rhythm.",
    "yoe": 4,
    "clientele": "Gen Z and millennials",
    "longbio": "Tony's journey into financial coaching was driven by his personal experience with the challenges of managing debt and navigating financial uncertainty. Recognizing a gap in accessible financial guidance, he founded his coaching business to fill that void and help others avoid the struggles he faced. Having once been burdened by debt, Tony embarked on a transformative path of financial literacy, learning how to budget effectively, pay down debt, and build long-term wealth through saving and investing. His own journey led to significant milestones, including achieving homeownership, consistent investing, and financial peace. This success motivated Tony to create a business focused on empowering others to take control of their finances. Through personalized coaching and education, Tony helps clients navigate the complexities of budgeting, debt management, investing, and real estate. His mission is to provide the support, resources, and knowledge necessary for individuals and families to avoid the trial and error he experienced, ultimately building a brighter, more secure financial future.",
    "previewblurb": "Empowering Gen Z and millennials to achieve financial freedom and build secure futures!",
    "profileurl": "/experts/TonyWare.jpg"
  },
  {
    "id": 25,
    "name": "Renavest",
    "title": "Financial Coach",
    "bookingurl": "https://calendly.com/stanley-renavestapp/60min",
    "demo_url": "https://calendly.com/stanley-renavestapp/30min",
    "expertise": "Budgeting, Debt management, Investing, Real estate",
    "certifications": "Certified 401(k) Plan Fiduciary and I've helped dozens of clients move from financial paralysis to competence and confidence.",
    "song": "New financial rhythm.",
    "yoe": 15,
    "clientele": "Gen Z and millennials",
    "longbio": "Tony's journey into financial coaching was driven by his personal experience with the challenges of managing debt and navigating financial uncertainty. Recognizing a gap in accessible financial guidance, he founded his coaching business to fill that void and help others avoid the struggles he faced. Having once been burdened by debt, Tony embarked on a transformative path of financial literacy, learning how to budget effectively, pay down debt, and build long-term wealth through saving and investing. His own journey led to significant milestones, including achieving homeownership, consistent investing, and financial peace. This success motivated Tony to create a business focused on empowering others to take control of their finances. Through personalized coaching and education, Tony helps clients navigate the complexities of budgeting, debt management, investing, and real estate. His mission is to provide the support, resources, and knowledge necessary for individuals and families to avoid the trial and error he experienced, ultimately building a brighter, more secure financial future.",
    "previewblurb": "Empowering Gen Z and millennials to achieve financial freedom and build secure futures!",
    "profileurl": ""
  }
]